app/views/books/_like.html.erb

      <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
      <%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

      <i class="fa fa-heart" aria-hidden="true"></i>
      <%= book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]